# Parameters
nc: 10  # number of classes
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] #  4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]  # 10

  - [6, 1, Conv, [256, 1, 1]] # 11
  - [5, 1, Conv, [256, 1, 1]] # 12
  - [4, 1, Conv, [256, 1, 1]] # 13

  - [-1, 1, Conv, [256, 3, 2]]   # 14
  - [[-3, -1], 1, Concat, [1]] #  15
  - [-1, 1, MRF, []] # 16
  - [-1, 3, RepC3, [256, 0.5]] #  17

  - [[17, 11, 10], 1, CrossLayerChannelHiLoAttention, []] # 18
  - [18, 1, GetIndexOutput, [0]] # 19-P3/8
  - [18, 1, GetIndexOutput, [1]] # 20-P4/16
  - [18, 1, GetIndexOutput, [2]] # 21-P5/32
  -
  - [[19, 20, 21], 1, CrossLayerHiLoSpatialAttention, []] # 22
  - [22, 1, GetIndexOutput, [0]] # 23-P3/8
  - [22, 1, GetIndexOutput, [1]] # 24-P4/16
  - [22, 1, GetIndexOutput, [2]] # 25-P5/32

  - [[17, 23], 1, Add, []] # 26-P3/8
  - [[11, 24], 1, Add, []] # 27-P4/16
  - [[10, 25], 1, Add, []] # 28-P5/32

  - [[26, 27, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)